const mockImageCover = '/mock/museum/about-cover'
const mockImageGraphDesktop = '/mock/museum/graph-desktop'
// const mockImageGraphMobile = '/mock/museum/graph-mobile'

export const museumMenu = [
    {
        title: 'про музей',
        filter: '/museum/about',
        default: true
    },
    {
        title: 'Фонди музею',
        filter: '/museum/fonds'
    },
    {
        title: 'Книга памʼяті',
        filter: '/museum/memory'
    },
    {
        title: 'Дослідникам',
        filter: '/museum/reports'
    },
    {
        title: 'Мапа музею',
        filter: '/museum/museum-map'
    },
    {
        title: 'Допомога музею',
        filter: '/museum/help-museum'
    }
]

export const mockAbout = {
    slug: "new-1",
    title: "про музей",
    body: `<img src='${mockImageCover}' /><h2>“Est dolendi modus, non est timendi dolendi”</h2><h3>“Є межа у печалі, але тривога не має межі”</h3><p>Національний музей “Чорнобиль” є багатофункціональним історико-культурним закладом, який поєднує наукову, культурно-просвітницьку діяльність з діяльністю сучасного музею з архівування, збереження та оприлюднення історії ядерної аварії на Чорнобильській АЕС як найбільш важкої радіоекологічної катастрофи ХХ століття, наслідки якої не мають аналогів і відрізняються від інших відомих у світі природних та техногенних катастроф. Вони досі є проблемами сьогодення і, нажаль, будуть нагадуватимуть про себе й нашим нащадкам.</p><p>Музей відкритий для публіки 26 квітня 1992 у столиці України Києві, в ста кілометрах від епіцентру катастрофи.</p><p>Місія музею – допомогти людству усвідомити масштаби катастрофи через долі тисяч людей – її учасників, свідків і жертв, змусити людей визнати необхідність примирення між людиною, наукою і технологіями, які поставили під конкретну загрозу існування людської цивілізації і самої планети Земля, осмислити уроки трагедії у всіх сферах життя і не дати світові забути ці уроки, стати попередженням поколінням нового тисячоліття.</p><p>Місія музею – допомогти людству усвідомити масштаби катастрофи через долі тисяч людей – її учасників, свідків і жертв, змусити людей визнати необхідність примирення між людиною, наукою і технологіями, які поставили під конкретну загрозу існування людської цивілізації і самої планети Земля, осмислити уроки трагедії у всіх сферах життя і не дати світові забути ці уроки, стати попередженням поколінням нового тисячоліття.</p><p>Наша мета – зробити музей освітнім центром екологічної культури та культури безпеки життя. Для цього ми об’єднуємо під дахом музею спеціалістів, науковців, викладачів, громадськість України та світу, розробляємо різноманітні просвітницькі та соціально-культурні програми для всіх верств відвідувачів.Багатство музейної колекції, високий науковий та художньо-естетичний рівень постійної експозиції та тимчасових виставок, відповідна фахова підготовка працівників, дають можливість вдовольнити вікові, фахові, духовні інтереси відвідувачів.</p><h2>Обсяг відвідувачів Національного музею «Чорнобиль»у 2010-2021 рр.</h2><img src='${mockImageGraphDesktop}' alt='museum' /><h2>історія музею</h2>`,
}