import image1 from '../assets/img/mock-news/1.jpg'
import image2 from '../assets/img/mock-news/2.jpg'
import image3 from '../assets/img/mock-news/3.jpg'
import image4 from '../assets/img/mock-news/4.jpg'
import image5 from '../assets/img/mock-news/5.jpg'
import image6 from '../assets/img/mock-news/6.jpg'


export const newsFilter = [
    {
        title: 'всі новини',
        filter: 'all',
        default: true
    },
    {
        title: 'анонси',
        filter: 'announces'
    },
    {
        title: 'події, що відбулися',
        filter: 'announces-now'
    },
    {
        title: 'Репортажі',
        filter: 'reports'
    },
    {
        title: 'нові статті',
        filter: 'new'
    },
    {
        title: 'експонати',
        filter: 'exponats'
    }
]


export const mockNews = [
    {
        id: 1,
        image: image1,
        title: 'ВСЕСВІТНІЙ ДЕНЬ БОРОТЬБИ ЗА ЗАБОРОНУ ЯДЕРНОЇ ЗБРОЇ',
        date: '06.08.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 2,
        image: image2,
        title: 'УВАГА! З 1 ЧЕРВНЯ МУЗЕЙ ВІДНОВЛЮЄ ПРИЙОМ ВІДВІДУВАЧІВ!',
        date: '31.05.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 3,
        image: image3,
        title: 'ДО 35-Х РОКОВИН ЧОРНОБИЛЬСЬКОЇ КАТАСТРОФИ. “ДЗВІНОК...',
        date: '30.06.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 4,
        image: image4,
        title: 'ВСЕСВІТНІЙ ДЕНЬ БОРОТЬБИ ЗА ЗАБОРОНУ ЯДЕРНОЇ ЗБРОЇ',
        date: '06.08.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 5,
        image: image5,
        title: 'УВАГА! З 1 ЧЕРВНЯ МУЗЕЙ ВІДНОВЛЮЄ ПРИЙОМ ВІДВІДУВАЧІВ!',
        date: '31.05.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 6,
        image: image6,
        title: 'ДО 35-Х РОКОВИН ЧОРНОБИЛЬСЬКОЇ КАТАСТРОФИ. “ДЗВІНОК...',
        date: '30.06.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 7,
        image: image1,
        title: 'ВСЕСВІТНІЙ ДЕНЬ БОРОТЬБИ ЗА ЗАБОРОНУ ЯДЕРНОЇ ЗБРОЇ',
        date: '06.08.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 8,
        image: image2,
        title: 'УВАГА! З 1 ЧЕРВНЯ МУЗЕЙ ВІДНОВЛЮЄ ПРИЙОМ ВІДВІДУВАЧІВ!',
        date: '31.05.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
]



export const mockArticle1 = {
    date: '26.02.2022',
    title: 'ВСЕСВІТНІЙ ДЕНЬ БОРОТЬБИ ЗА ЗАБОРОНУ ЯДЕРНОЇ ЗБРОЇ. МІЖНАРОДНА КОММЕМОРАТИВНА ВИСТАВКА. ХІРОШІМА. НАГАСАКІ. ОПАЛЕНИЙ РАЙ. ПАМ’ЯТАЄМО.',
    cover: '/mock/article/main.png',
    content: [
        {
            type: 'paragraph',
            content: "<p>6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї. Ця пам’ятна сумна дата щорічно відносить нас до трагічних подій 1945 року у японських містах Хіросими та Нагасакі, які стали початком нової ери у житті людства, яке пізнало рокові жахливі наслідки руйнівної сили ядерної зброї. У Японії у цей день проходить Хірошімська меморіальна церемонія миру. Національний музей «Чорнобиль» відкриває міжнародну коммомеративну фотодокументальну виставку ХІРОШІМА. НАГАСАКІ. ОПАЛЕНИЙ РАЙ. ПАМ’ЯТАЄМО. До створення виставки долучилися японські музеї: Мемориальний музей мира в Хирошімі та Національний меморіальний зал жертв атомної бомби в Нагасакі, Громадська організація ANT-Хірошіма (Азіатська мережа довіри), Проект Окіагарі Кобоші. Експозицію об’єднує скульптурна композиція <a href='/news'>«Попіл атомної епохи»</a>, автором якої є український скульптор Astian Rey. Мета виставки – допомогти новому поколінню зрозуміти весь жах, що пережили жертви атомної катастрофи, не дати світові забути про довготривалі радіаційні наслідки ядерної війни, не допустити подібного у майбутньому. ВХІД ВІЛЬНИЙ<p>"
        },
        {
            type: 'images',
            content: [
                '/mock/article/1.png',
                '/mock/article/2.png',
                '/mock/article/3.png'
            ]
        }
    ]
}



export const mockNewsMore = [
    {
        id: 1,
        image: image1,
        title: 'ВСЕСВІТНІЙ ДЕНЬ БОРОТЬБИ ЗА ЗАБОРОНУ ЯДЕРНОЇ ЗБРОЇ',
        date: '06.08.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 2,
        image: image2,
        title: 'УВАГА! З 1 ЧЕРВНЯ МУЗЕЙ ВІДНОВЛЮЄ ПРИЙОМ ВІДВІДУВАЧІВ!',
        date: '31.05.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 3,
        image: image3,
        title: 'ДО 35-Х РОКОВИН ЧОРНОБИЛЬСЬКОЇ КАТАСТРОФИ. “ДЗВІНОК...',
        date: '30.06.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    },
    {
        id: 4,
        image: image4,
        title: 'ВСЕСВІТНІЙ ДЕНЬ БОРОТЬБИ ЗА ЗАБОРОНУ ЯДЕРНОЇ ЗБРОЇ',
        date: '06.08.2021',
        text: '6 серпня – за рішенням ООН встановлений Всесвітній День боротьби за заборону ядерної зброї...'
    }
]